# Data Load into postgreSQL database

## Import Dependencies

In [1]:
import pandas as pd
from sqlalchemy import create_engine

## Read in CSV file to be loaded to database

In [2]:
file = "../resources/data.csv"
data = pd.read_csv(file)
data.head()

,date,year,month,online_food_turnover,online_nonfood_turnover,online_total_turnover,total_revenue_turnover
0,Jul-2013,2013,Jul,139.5,331.4,470.9,22042.6
1,Aug-2013,2013,Aug,146.7,329.6,476.3,22204.7
2,Sep-2013,2013,Sep,139.7,322.7,462.4,22356.5
3,Oct-2013,2013,Oct,127.9,351.6,479.5,22431.6
4,Nov-2013,2013,Nov,138.5,388.1,526.6,22630.9

## Add database connection

In [3]:
# connect to database
connection_string = "USERNAME:PASSWORD@localhost:5432/ecommerce"
engine = create_engine(f'postgresql://{connection_string}')

In [4]:
# confirm tables
engine.table_names()

['ecomau']

 ## Load dataframe into database

In [5]:
# use pandas to load dataframe to database
data.to_sql(name='ecomau', con=engine, if_exists='append', index=False)

## Check that dataframe has loaded successfully

In [6]:
pd.read_sql_query('select * from ecomau', con=engine).head()

,id,date,year,month,online_food_turnover,online_nonfood_turnover,online_total_turnover,total_revenue_turnover
0,1,Jul-2013,2013,Jul,139.5,331.4,470.9,22042.6
1,2,Aug-2013,2013,Aug,146.7,329.6,476.3,22204.7
2,3,Sep-2013,2013,Sep,139.7,322.7,462.4,22356.5
3,4,Oct-2013,2013,Oct,127.9,351.6,479.5,22431.6
4,5,Nov-2013,2013,Nov,138.5,388.1,526.6,22630.9